RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART18_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART18_NonBlockingDriverState);

#if defined(USART18_RX_BUFFER_ENABLE) && (USART18_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART18_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART18_NonBlockingDriverState.resource->base,
                                       LPUART18_NonBlockingDriverState.handle, lpuart18_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART18_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART18_NonBlockingDriverState);
}

static int32_t LPUART18_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART18_NonBlockingDriverState);
}

static int32_t LPUART18_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART18_NonBlockingDriverState);
}

static uint32_t LPUART18_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART18_NonBlockingDriverState);
}

static uint32_t LPUART18_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART18_NonBlockingDriverState);
}

static int32_t LPUART18_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART18_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART18_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART18_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART18_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART18_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART18 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART18_DMA_EN) && RTE_USART18_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART18_EdmaInitialize, LPUART18_EdmaUninitialize, LPUART18_EdmaPowerControl,
                                   LPUART18_EdmaSend,       LPUART18_EdmaReceive,      LPUART18_EdmaTransfer,
                                   LPUART18_EdmaGetTxCount, LPUART18_EdmaGetRxCount,   LPUART18_EdmaControl,
                                   LPUART18_EdmaGetStatus,
#else
                                   LPUART18_DmaInitialize,  LPUART18_DmaUninitialize, LPUART18_DmaPowerControl,
                                   LPUART18_DmaSend,        LPUART18_DmaReceive,      LPUART18_DmaTransfer,
                                   LPUART18_DmaGetTxCount,  LPUART18_DmaGetRxCount,   LPUART18_DmaControl,
                                   LPUART18_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART18_NonBlockingInitialize,
                                  LPUART18_NonBlockingUninitialize,
                                  LPUART18_NonBlockingPowerControl,
                                  LPUART18_NonBlockingSend,
                                  LPUART18_NonBlockingReceive,
                                  LPUART18_NonBlockingTransfer,
                                  LPUART18_NonBlockingGetTxCount,
                                  LPUART18_NonBlockingGetRxCount,
                                  LPUART18_NonBlockingControl,
                                  LPUART18_NonBlockingGetStatus,
#endif /* RTE_USART18_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART18 */

#if (defined(LPUART19) || defined(LPUART_19)) && defined(RTE_USART19) && RTE_USART19

/* User needs to provide the implementation for LPUART19_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART19_GetFreq(void);

#if defined(LPUART19)
static cmsis_lpuart_resource_t LPUART19_Resource = {LPUART19, LPUART19_GetFreq};
#elif defined(LPUART_19)
static cmsis_lpuart_resource_t LPUART19_Resource = {LPUART_19, LPUART19_GetFreq};
#endif

#if defined(RTE_USART19_DMA_EN) && RTE_USART19_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART19_DmaResource = {
    RTE_USART19_DMA_TX_DMA_BASE,    RTE_USART19_DMA_TX_CH,          RTE_USART19_DMA_TX_PERI_SEL,
    RTE_USART19_DMA_RX_DMA_BASE,    RTE_USART19_DMA_RX_CH,          RTE_USART19_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART19_DMA_TX_DMAMUX_BASE, RTE_USART19_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART19_DMAMUX_TX_CH,       RTE_USART19_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART19_DmaHandle;
static dma_handle_t LPUART19_DmaRxHandle;
static dma_handle_t LPUART19_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart19_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART19_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART19_DmaDriverState = {
#endif
    &LPUART19_Resource, &LPUART19_DmaResource, &LPUART19_DmaHandle, &LPUART19_DmaRxHandle, &LPUART19_DmaTxHandle,
};

static int32_t LPUART19_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART19_PIN_INIT
    RTE_USART19_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART19_DmaDriverState);
}

static int32_t LPUART19_DmaUninitialize(void)
{
#ifdef RTE_USART19_PIN_DEINIT
    RTE_USART19_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART19_DmaDriverState);
}

