RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART19_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART19_DmaDriverState);
}

static int32_t LPUART19_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART19_DmaDriverState);
}

static int32_t LPUART19_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART19_DmaDriverState);
}

static int32_t LPUART19_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART19_DmaDriverState);
}

static uint32_t LPUART19_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART19_DmaDriverState);
}

static uint32_t LPUART19_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART19_DmaDriverState);
}

static int32_t LPUART19_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART19_DmaDriverState);
}

static ARM_USART_STATUS LPUART19_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART19_DmaDriverState);
}

/* LPUART19 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART19_EdmaResource = {
    RTE_USART19_DMA_TX_DMA_BASE,    RTE_USART19_DMA_TX_CH,          RTE_USART19_DMA_TX_PERI_SEL,
    RTE_USART19_DMA_RX_DMA_BASE,    RTE_USART19_DMA_RX_CH,          RTE_USART19_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART19_DMA_TX_DMAMUX_BASE, RTE_USART19_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART19_EdmaHandle;
static edma_handle_t LPUART19_EdmaRxHandle;
static edma_handle_t LPUART19_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart19_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART19_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART19_EdmaDriverState = {
#endif
    &LPUART19_Resource, &LPUART19_EdmaResource, &LPUART19_EdmaHandle, &LPUART19_EdmaRxHandle, &LPUART19_EdmaTxHandle,
};

static int32_t LPUART19_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART19_PIN_INIT
    RTE_USART19_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART19_EdmaDriverState);
}

static int32_t LPUART19_EdmaUninitialize(void)
{
#ifdef RTE_USART19_PIN_DEINIT
    RTE_USART19_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART19_EdmaDriverState);
}

static int32_t LPUART19_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART19_EdmaDriverState);
}

static int32_t LPUART19_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART19_EdmaDriverState);
}

static int32_t LPUART19_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART19_EdmaDriverState);
}

static int32_t LPUART19_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART19_EdmaDriverState);
}

static uint32_t LPUART19_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART19_EdmaDriverState);
}

static uint32_t LPUART19_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART19_EdmaDriverState);
}

static int32_t LPUART19_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART19_EdmaDriverState);
}

static ARM_USART_STATUS LPUART19_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART19_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART19_Handle;

#if defined(USART19_RX_BUFFER_ENABLE) && (USART19_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart19_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart19_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART19_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART19_NonBlockingDriverState = {
#endif
    &LPUART19_Resource,
    &LPUART19_Handle,
};

static int32_t LPUART19_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART19_PIN_INIT
    RTE_USART19_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART19_NonBlockingDriverState);
}

static int32_t LPUART19_NonBlockingUninitialize(void)
{
#ifdef RTE_USART19_PIN_DEINIT
    RTE_USART19_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART19_NonBlockingDriverState);
}

static int32_t LPUART19_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART19_NonBlockingDriverState);

#if defined(USART19_RX_BUFFER_ENABLE) && (USART19_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART19_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART19_NonBlockingDriverState.resource->base,
                                       LPUART19_NonBlockingDriverState.handle, lpuart19_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART19_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART19_NonBlockingDriverState);
}

static int32_t LPUART19_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART19_NonBlockingDriverState);
}

static int32_t LPUART19_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART19_NonBlockingDriverState);
}

static uint32_t LPUART19_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART19_NonBlockingDriverState);
}

static uint32_t LPUART19_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART19_NonBlockingDriverState);
}

static int32_t LPUART19_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART19_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART19_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART19_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART19_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART19_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART19 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART19_DMA_EN) && RTE_USART19_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART19_EdmaInitialize, LPUART19_EdmaUninitialize, LPUART19_EdmaPowerControl,
                                   LPUART19_EdmaSend,       LPUART19_EdmaReceive,      LPUART19_EdmaTransfer,
                                   LPUART19_EdmaGetTxCount, LPUART19_EdmaGetRxCount,   LPUART19_EdmaControl,
                                   LPUART19_EdmaGetStatus,
#else
                                   LPUART19_DmaInitialize,  LPUART19_DmaUninitialize, LPUART19_DmaPowerControl,
                                   LPUART19_DmaSend,        LPUART19_DmaReceive,      LPUART19_DmaTransfer,
                                   LPUART19_DmaGetTxCount,  LPUART19_DmaGetRxCount,   LPUART19_DmaControl,
                                   LPUART19_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART19_NonBlockingInitialize,
                                  LPUART19_NonBlockingUninitialize,
                                  LPUART19_NonBlockingPowerControl,
                                  LPUART19_NonBlockingSend,
                                  LPUART19_NonBlockingReceive,
                                  LPUART19_NonBlockingTransfer,
                                  LPUART19_NonBlockingGetTxCount,
                                  LPUART19_NonBlockingGetRxCount,
                                  LPUART19_NonBlockingControl,
                                  LPUART19_NonBlockingGetStatus,
#endif /* RTE_USART19_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

